<h1>ðŸ“Œ Explorando a Biblioteca Pandas em Python: seleÃ§Ã£o de dados</h1>

<h3>ðŸ“Œ Um Guia PrÃ¡tico para Iniciantes</h3>

<p style='font-size:16px;'>A biblioteca Pandas Ã© uma das ferramentas mais poderosas e populares da linguagem Python para anÃ¡lise e manipulaÃ§Ã£o de dados. Criada por Wes McKinney, ela se tornou essencial para cientistas de dados, analistas e desenvolvedores que trabalham com grandes volumes de informaÃ§Ãµes.</p>

<p>O Pandas (derivado de Panel Data) Ã© uma biblioteca de cÃ³digo aberto voltada para trabalhar com dados estruturados, ou seja, dados organizados em tabelas.</p>

<h3>ðŸ“Œ SeleÃ§Ã£o de dados</h3>

<p style='font-size:16px;'>A seleÃ§Ã£o de dados Ã© uma das tarefas mais importantes no uso do Pandas, pois permite acessar informaÃ§Ãµes de forma flexÃ­vel. No Pandas, a seleÃ§Ã£o Ã© feita principalmente por indexaÃ§Ã£o (usando colchetes [] - operador de indexaÃ§Ã£o), usando os mÃ©todos .loc (para rÃ³tulos) e .iloc (para Ã­ndices numÃ©ricos), entre outras formas. VocÃª pode selecionar colunas especÃ­ficas, mÃºltiplas colunas, linhas baseadas em condiÃ§Ãµes ou por posiÃ§Ã£o, e atÃ© subconjuntos que combinam linhas e colunas.</p>

ðŸ“ŒAutor: Carlos da Costa<br>
ðŸ“ŒRecife, PE - Brasil<br>
ðŸ“ŒTelefone: +55 81 99712 9140<br>
ðŸ“ŒTelegram: @jcarlossc<br>
ðŸ“ŒBlogger linguagem R: https://informaticus77-r.blogspot.com/<br>
ðŸ“ŒBlogger linguagem Python: https://informaticus77-python.blogspot.com/<br>
ðŸ“ŒEmail: jcarlossc1977@gmail.com<br>
ðŸ“ŒPortfÃ³lio em construÃ§Ã£o: https://portfolio-carlos-costa.netlify.app/<br>
ðŸ“ŒLinkedIn: https://www.linkedin.com/in/carlos-da-costa-669252149/<br>
ðŸ“ŒGitHub: https://github.com/jcarlossc<br>
ðŸ“ŒKaggle: https://www.kaggle.com/jcarlossc/<br>
ðŸ“ŒTwitter/X: https://x.com/jcarlossc1977

In [1]:
# Importando a biblioteca Pandas
import pandas as pd

In [2]:
# Criando um DataFrame de exemplo
dados = pd.DataFrame(
    {
    'nome': ['Teresa', 'Soares', 'Jose', 'Carlos', 'Maria', 'Teresa'],
    'idade': [3, 35, 31, 48, 40, 56],
    'cidade': ['Recife', 'Paulista', 'Olinda', 'Caruaru', 'Petrolina', 'Timbauba'],
    'salario': [3200, 4500, 5000, 3700, 6000, 7000]
    }
)

In [3]:
# InformaÃ§Ãµes sobre quantidade de observaÃ§Ãµes(6), nÃºmero de colunas(4),
# uso de memÃ³ria e tipos de dados.
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   nome     6 non-null      object
 1   idade    6 non-null      int64
 2   cidade   6 non-null      object
 3   salario  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

<h2>ðŸ“Œ SeleÃ§Ã£o de colunas</h2>

In [4]:
# Selecionar uma Ãºnica coluna.
dados['nome']

0    Teresa
1    Soares
2      Jose
3    Carlos
4     Maria
5    Teresa
Name: nome, dtype: object

In [5]:
# Selecionar multiplas colunas.
dados[['nome', 'idade']]

     nome  idade
0  Teresa      3
1  Soares     35
2    Jose     31
3  Carlos     48
4   Maria     40
5  Teresa     56

<h2>ðŸ“Œ SeleÃ§Ã£o por Ã­ndices e posiÃ§Ãµes com iloc.</h2>

In [6]:
# Seleciona a primeira linha.
dados.iloc[0]

nome       Teresa
idade           3
cidade     Recife
salario      3200
Name: 0, dtype: object

In [7]:
# Da 1Âª Ã  3Âª linha (exclusive)
dados.iloc[0:3]

     nome  idade    cidade  salario
0  Teresa      3    Recife     3200
1  Soares     35  Paulista     4500
2    Jose     31    Olinda     5000

In [8]:
# Seleciona primeira coluna.
dados.iloc[:, 0]

0    Teresa
1    Soares
2      Jose
3    Carlos
4     Maria
5    Teresa
Name: nome, dtype: object

In [9]:
# Duas primeiras colunas
dados.iloc[:, 0:2]

     nome  idade
0  Teresa      3
1  Soares     35
2    Jose     31
3  Carlos     48
4   Maria     40
5  Teresa     56

In [10]:
# Seleciona elemento linha 2, coluna 3
dados.iloc[1, 2]

'Paulista'

<h2>ðŸ“Œ SeleÃ§Ã£o por rÃ³tulo(label) com loc.</h2>

In [11]:
# Seleciona linhas com Ã­ntervalo de Ã­ndices e nomes de colunas.
dados.loc[0:2, ['nome', 'cidade']]

     nome    cidade
0  Teresa    Recife
1  Soares  Paulista
2    Jose    Olinda

In [12]:
# Definindo a coluna "name" como Ã­ndice (rÃ³tulo das linhas).
dados_loc = pd.DataFrame(dados).set_index('nome')

In [13]:
# Seleciona uma linha pelo rÃ³tulo.
dados_loc.loc['Teresa']

        idade    cidade  salario
nome
Teresa      3    Recife     3200
Teresa     56  Timbauba     7000

In [14]:
# Seleciona uma linha pelo rÃ³tulo.
dados_loc.loc[['Carlos', 'Teresa']]

        idade    cidade  salario
nome
Carlos     48   Caruaru     3700
Teresa      3    Recife     3200
Teresa     56  Timbauba     7000

In [15]:
# Seleciona linha e coluna.
dados_loc.loc['Soares', 'salario']

4500

In [16]:
# Seleciona linhas e colunas especÃ­ficas.
dados_loc.loc['Soares':'Jose', ['idade', 'cidade']]

        idade    cidade
nome
Soares     35  Paulista
Jose       31    Olinda

<h2>ðŸ“Œ SeleÃ§Ã£o por valores nulos ou duplicados</h2>

In [17]:
# SeleÃ§Ã£o por dados nulos.
dados[dados['idade'].isna()]

Empty DataFrame
Columns: [nome, idade, cidade, salario]
Index: []

In [18]:
# Seleciona linhas sem valores nulos.
dados[dados['idade'].notna()]

     nome  idade     cidade  salario
0  Teresa      3     Recife     3200
1  Soares     35   Paulista     4500
2    Jose     31     Olinda     5000
3  Carlos     48    Caruaru     3700
4   Maria     40  Petrolina     6000
5  Teresa     56   Timbauba     7000

In [19]:
# Seleciona valores duplicados.
dados[dados.duplicated('nome', keep=False)]

     nome  idade    cidade  salario
0  Teresa      3    Recife     3200
5  Teresa     56  Timbauba     7000

<h2>ðŸ“Œ SeleÃ§Ã£o e ordenaÃ§Ã£o de dados</h2>

In [20]:
# Seleciona e ordena por idade.
dados.sort_values('idade', ascending=True)

     nome  idade     cidade  salario
0  Teresa      3     Recife     3200
2    Jose     31     Olinda     5000
1  Soares     35   Paulista     4500
4   Maria     40  Petrolina     6000
3  Carlos     48    Caruaru     3700
5  Teresa     56   Timbauba     7000

<h2>ðŸ“Œ SeleÃ§Ã£o com amostragem e limites</h2>

In [21]:
# Seleciona as 3 primeiras linhas
dados.head(3)

     nome  idade    cidade  salario
0  Teresa      3    Recife     3200
1  Soares     35  Paulista     4500
2    Jose     31    Olinda     5000

In [22]:
# Seleciona as 2 Ãºltimas linhas.
dados.tail(2)

     nome  idade     cidade  salario
4   Maria     40  Petrolina     6000
5  Teresa     56   Timbauba     7000

In [23]:
# Seleciona 2 linhas aleatÃ³rias.
dados.sample(2)

     nome  idade    cidade  salario
0  Teresa      3    Recife     3200
5  Teresa     56  Timbauba     7000